app/Controllers/Notices.php

SELECT *
FROM `notices`
WHERE `notices`.`deleted_at` IS NULL
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `notices`
WHERE `notices`.`deleted_at` IS NULL
---
    public function index()
    {

        $model = new NoticesModel();

        $data = [
            'title' => 'Últimas Noticias',
            'notices' => $model->paginate(3),