app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `user` = 'admin'
AND `password` = '202cb962ac59075b964b07152d234b70'
 LIMIT 1
---
    public function getUsers($user, $password)
    {

        return $this->asArray()
            ->where(['user' => $user, 'password' => md5($password)])
            ->first();